{"keras_version": "2.1.6", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_38", "input_layers": [["input_38", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_38", "config": {"batch_input_shape": [null, 4596], "dtype": "float32", "sparse": false, "name": "input_38"}}, {"inbound_nodes": [[["input_38", 0, 0, {}]]], "class_name": "Sequential", "name": "sequential_35", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_88", "activation": "linear", "batch_input_shape": [null, 4596], "kernel_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_63", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_37", "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_64", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_38", "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_90", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_regularizer": null, "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_65", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_39", "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.8, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_91", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "tanh", "kernel_regularizer": null, "units": 2352, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true}}]}], "output_layers": [["sequential_35", 1, 0]]}}